Problem Statement

In this file using following columns build a model to predict if person would survive or not,

Pclass

Sex

Age

Fare

Calculate score of your model

In [162]:
import pandas as pd

In [163]:
# importing the data set
df=pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/Exercise/titanic.csv")
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [164]:
#clearing Nan values
df=df.dropna()

In [165]:
#creating the input data set 
input=df.drop(["Survived","Name",'SibSp','Parch','Ticket','Cabin','Embarked','PassengerId'],axis="columns")
# input
##creating the target data set 
target=df["Survived"]
target

1      1
3      1
6      0
10     1
11     1
      ..
871    1
872    0
879    1
887    1
889    1
Name: Survived, Length: 183, dtype: int64

In [166]:
input

     Pclass     Sex   Age     Fare
1         1  female  38.0  71.2833
3         1  female  35.0  53.1000
6         1    male  54.0  51.8625
10        3  female   4.0  16.7000
11        1  female  58.0  26.5500
..      ...     ...   ...      ...
871       1  female  47.0  52.5542
872       1    male  33.0   5.0000
879       1  female  56.0  83.1583
887       1  female  19.0  30.0000
889       1    male  26.0  30.0000

[183 rows x 4 columns]

In [167]:
#encoding the values
from sklearn.preprocessing import LabelEncoder
l1=LabelEncoder()
l2=LabelEncoder()
l3=LabelEncoder()

In [168]:
input['sex']=l1.fit_transform(input['Sex'])
input['age']=l2.fit_transform(input['Age'])
input['fare']=l3.fit_transform(input['Fare'])

In [169]:
input=input.drop(['Sex'],axis='columns')

In [170]:
input

     Pclass   Age     Fare  sex  age  fare
1         1  38.0  71.2833    0   32    57
3         1  35.0  53.1000    0   28    44
6         1  54.0  51.8625    1   49    41
10        3   4.0  16.7000    0    4    10
11        1  58.0  26.5500    0   53    17
..      ...   ...      ...  ...  ...   ...
871       1  47.0  52.5542    0   42    43
872       1  33.0   5.0000    1   26     1
879       1  56.0  83.1583    0   51    68
887       1  19.0  30.0000    0   12    23
889       1  26.0  30.0000    1   18    23

[183 rows x 6 columns]

In [171]:
input.dropna()

     Pclass   Age     Fare  sex  age  fare
1         1  38.0  71.2833    0   32    57
3         1  35.0  53.1000    0   28    44
6         1  54.0  51.8625    1   49    41
10        3   4.0  16.7000    0    4    10
11        1  58.0  26.5500    0   53    17
..      ...   ...      ...  ...  ...   ...
871       1  47.0  52.5542    0   42    43
872       1  33.0   5.0000    1   26     1
879       1  56.0  83.1583    0   51    68
887       1  19.0  30.0000    0   12    23
889       1  26.0  30.0000    1   18    23

[183 rows x 6 columns]

In [172]:
input=input.drop(["Age",'Fare'],axis=1)

In [173]:
#dividing the data set in training and testing data set
# # from sklearn.model_selection import train_test_split
from sklearn.model_selection import train_test_split
# target.dropna
# x_train,x_test,y_train,y_test=train_test_split(input.loc[:].values,target,test_size=.1)
#creating the test and train data set
x_train,x_test,y_train,y_test=train_test_split(input.loc[:].values,target,test_size=0.05)

In [174]:
#Importing libaray for decision tree
from sklearn import tree
model = tree.DecisionTreeClassifier()
model.fit(x_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [175]:
#calculating the score of the data set 

model.score(x_test,y_test)

0.9

In [176]:
model.predict([[2,1,1,5]])

array([1])